:PROPERTIES:
:ID:       feb4d288-6906-4661-a7eb-14f0fd358411
:END:
#+TITLE: Security: Linux, Keepass and Secret Service Integration
#+CATEGORY: slips
#+TAGS:  

** Emacs and Shell
Technically, it's possible to get =keepassxc= secrets via emacs, since =auth-source=
will let you fetch via =libsecret= as well. Configuring emacs to do this by
default is a bit too much, since it's just going to have anything that D-Bus
gives it. None of =auth-sources= is enabled by default.

+ =(auth-source-pass-get 'secret "api.github.com/dcunited001^ghub")= would get a
  token value to unsafely handle thereafter -- i.e. it ends up in the messages
  buffer, if you arbitrarily evaluate this stuff. So keep that in mind.
+ You can also fetch with =libsecret= via the =auth-source-secrets= backend, but the
  spec query needs to be stringified (it's in the source). I've tried this
  manually, but it was confusing. The comments clarify somewhat. 

#+begin_src emacs-lisp
(defun auth-source-secrets-search (&rest spec
                                         &key backend create delete label max
                                         &allow-other-keys)
  ;; ...
  )
#+end_src

As a shit-test, once =secrets.el= is loaded and once something is providing that
=D-Bus= service: you can run =M-: (secrets-list-collections)=

#+begin_src emacs-lisp
(secrets-list-collections)
#+end_src

#+RESULTS:
| muh-secrets-on-keepass |

It's seriously obtuse getting to this point otherwise. The code examples in
the actual Gnome libsecret docs look like they'd help.

** Secret-Tool

if you have zero apriori knowledge about how to use this...

+ =secret-tool= doesn't help 
  - it made more sense for me once I created a test wallet in KDE
+ =qdbus-viewer= can help, but you have to know the magic words
  - GetSecret :: this call requires a =session QDBusViewerObject=, which I don't
    know how to provide

#+begin_src shell :results output code :wrap example text
secret-tool --help
#+end_src

#+RESULTS:
#+begin_example
usage: secret-tool store --label='label' attribute value ...
       secret-tool lookup attribute value ...
       secret-tool clear attribute value ...
       secret-tool search [--all] [--unlock] attribute value ...
       secret-tool lock --collection='collection'
#+end_example

Once you have the collection, you can ask more questions. Thankfully, you can
get the collections with their attributes.

#+begin_src shell
secret-tool search --all Title soundiiz
#+end_src

